# References

https://www.kaggle.com/datasets/jihyeseo/online-retail-data-set-from-uci-ml-repo

In [1]:
# importing packages
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from mpl_toolkits import mplot3d
sns.set_style('darkgrid')
from sklearn.metrics import silhouette_score
from sklearn.cluster import KMeans
from sklearn.preprocessing import StandardScaler
import warnings
warnings.filterwarnings('ignore')

In [2]:
# loading retail data
df = pd.read_excel('C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/Online Retail.xlsx')
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [3]:
df.duplicated().sum()

5268

In [4]:
# removing duplicates
df = df[~df.duplicated()]
df.shape

(536641, 8)

In [5]:
# removing all the invoice number who starts with 'C' as they are returned orders
df = df[df['InvoiceNo'].str.startswith('C')!=True]
df.shape

(527390, 8)

In [6]:
# keeping only those transactions that have successfully ordered
df = df[df['Quantity']>=0]
df.shape

(526054, 8)

In [7]:
# putting UK as one country and combine rest countries into one category
df['Country'] = df['Country'].apply(lambda x:'United Kingdom' if x=='United Kingdom' else 'Others')
df.Country.value_counts(normalize=True)

United Kingdom    0.914627
Others            0.085373
Name: Country, dtype: float64

In [8]:
# removing all the above entries
df = df[df['Description'].str.startswith('?')!=True]
df.shape

(526048, 8)

In [9]:
# checking the data where description = * and it is noted that customerid is NaN
df[df['Description'].str.startswith('*')==True]

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
20749,538071,21120,*Boombox Ipod Classic,1,2010-12-09 14:09:00,16.98,NaN,United Kingdom
35675,539437,20954,*USB Office Mirror Ball,1,2010-12-17 14:54:00,8.47,NaN,United Kingdom
37095,539453,20954,*USB Office Mirror Ball,1,2010-12-17 17:08:00,8.47,NaN,United Kingdom

In [10]:
# replacing with appropriate name
df['Description'] = df['Description'].replace(('*Boombox Ipod Classic','*USB Office Mirror Ball'),
                                             ('BOOMBOX IPOD CLASSIC','USB OFFICE MIRROR BALL'))

In [11]:
# Description have actual entries in uppercase words and those who don't have are some of the noises in the dataset
df[df['Description'].str.islower()==True]['Description'].value_counts()

check                                  39
found                                  25
adjustment                             14
amazon                                  8
had been put aside                      5
dotcom                                  4
mailout                                 3
returned                                2
taig adjust                             2
test                                    2
found box                               1
alan hodge cant mamage this section     1
wrongly coded 20713                     1
website fixed                           1
allocate stock for dotcom orders ta     1
michel oops                             1
wrongly coded 23343                     1
check?                                  1
add stock to allocate online orders     1
dotcomstock                             1
wrongly sold (22719) barcode            1
to push order througha s stock was      1
came coded as 20713                     1
rcvd be air temp fix for dotcom sit     1
damaged                                 1
dotcom adjust                           1
wrongly marked                          1
for online retail orders                1
mailout                                 1
on cargo order                          1
wrongly marked 23343                    1
amazon adjust                           1
amazon sales                            1
did  a credit  and did not tick ret     1
Name: Description, dtype: int64

In [12]:
# removing all the above noises
df = df[df['Description'].str.islower()!=True]
df.shape

(525920, 8)

In [13]:
# Description have actual entries in uppercase words and those who don't have are some of the noises in the dataset
df[df['Description'].str.istitle()==True]['Description'].value_counts()

Manual                                 323
Next Day Carriage                       79
Bank Charges                            12
Dotcomgiftshop Gift Voucher £20.00       9
Dotcomgiftshop Gift Voucher £10.00       8
Found                                    8
Dotcomgiftshop Gift Voucher £30.00       7
Amazon                                   7
Dotcomgiftshop Gift Voucher £50.00       4
High Resolution Image                    3
Dotcomgiftshop Gift Voucher £40.00       3
Adjustment                               2
John Lewis                               1
Dotcomgiftshop Gift Voucher £100.00      1
Amazon Adjustment                        1
Name: Description, dtype: int64

In [14]:
# removing all the above listed noises
df = df[df['Description'].str.istitle()!=True]
df.shape

(525452, 8)

In [15]:
df['Description'] = df['Description'].str.strip()

In [16]:
# removing entries where customer id is null
df = df[~df.CustomerID.isnull()]
df.shape

(392353, 8)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392353 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    392353 non-null  object
 1   StockCode    392353 non-null  object
 2   Description  392353 non-null  object
 3   Quantity     392353 non-null  int64
 4   InvoiceDate  392353 non-null  datetime64[ns]
 5   UnitPrice    392353 non-null  float64
 6   CustomerID   392353 non-null  float64
 7   Country      392353 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 26.9+ MB

In [18]:
df.isnull().sum()

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [19]:
# checking random 5 rows from data
df.sample(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
341074,566733,23307,SET OF 60 PANTRY DESIGN CAKE CASES,24,2011-09-14 13:54:00,0.55,15103.0,United Kingdom
456350,575687,23188,VINTAGE 2 METRE FOLDING RULER,36,2011-11-10 16:03:00,1.65,16126.0,United Kingdom
142118,548552,21936,RED RETROSPOT PICNIC BAG,5,2011-04-01 09:06:00,2.95,17613.0,United Kingdom
85030,543458,22698,PINK REGENCY TEACUP AND SAUCER,2,2011-02-08 13:28:00,2.95,14587.0,United Kingdom
14015,537441,21876,POTTERING MUG,6,2010-12-06 17:26:00,1.25,13564.0,United Kingdom

## EDA

In [20]:
# creating some columns for exploratory

df['Amount'] = df['Quantity']*df['UnitPrice']
# df['year'] = df['InvoiceDate'].dt.year
# df['month'] = df['InvoiceDate'].dt.month
# df['day'] = df['InvoiceDate'].dt.day
# df['hour'] = df['InvoiceDate'].dt.hour
# df['day_of_week'] = df['InvoiceDate'].dt.dayofweek

In [21]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34

In [22]:
df.shape

(392353, 9)

In [23]:
# getting the data from timestamp
df_c = df.copy()
df_c['date'] = df_c['InvoiceDate'].dt.strftime('%Y-%m-%d')
df_c.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount,date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01

In [24]:
df_c['date'].unique()

array(['2010-12-01', '2010-12-02', '2010-12-03', '2010-12-05',
       '2010-12-06', '2010-12-07', '2010-12-08', '2010-12-09',
       '2010-12-10', '2010-12-12', '2010-12-13', '2010-12-14',
       '2010-12-15', '2010-12-16', '2010-12-17', '2010-12-19',
       '2010-12-20', '2010-12-21', '2010-12-22', '2010-12-23',
       '2011-01-04', '2011-01-05', '2011-01-06', '2011-01-07',
       '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
       '2011-01-13', '2011-01-14', '2011-01-16', '2011-01-17',
       '2011-01-18', '2011-01-19', '2011-01-20', '2011-01-21',
       '2011-01-23', '2011-01-24', '2011-01-25', '2011-01-26',
       '2011-01-27', '2011-01-28', '2011-01-30', '2011-01-31',
       '2011-02-01', '2011-02-02', '2011-02-03', '2011-02-04',
       '2011-02-06', '2011-02-07', '2011-02-08', '2011-02-09',
       '2011-02-10', '2011-02-11', '2011-02-13', '2011-02-14',
       '2011-02-15', '2011-02-16', '2011-02-17', '2011-02-18',
       '2011-02-20', '2011-02-21', '2011-02-22', '2011-02-23',
       '2011-02-24', '2011-02-25', '2011-02-27', '2011-02-28',
       '2011-03-01', '2011-03-02', '2011-03-03', '2011-03-04',
       '2011-03-06', '2011-03-07', '2011-03-08', '2011-03-09',
       '2011-03-10', '2011-03-11', '2011-03-13', '2011-03-14',
       '2011-03-15', '2011-03-16', '2011-03-17', '2011-03-18',
       '2011-03-20', '2011-03-21', '2011-03-22', '2011-03-23',
       '2011-03-24', '2011-03-25', '2011-03-27', '2011-03-28',
       '2011-03-29', '2011-03-30', '2011-03-31', '2011-04-01',
       '2011-04-03', '2011-04-04', '2011-04-05', '2011-04-06',
       '2011-04-07', '2011-04-08', '2011-04-10', '2011-04-11',
       '2011-04-12', '2011-04-13', '2011-04-14', '2011-04-15',
       '2011-04-17', '2011-04-18', '2011-04-19', '2011-04-20',
       '2011-04-21', '2011-04-26', '2011-04-27', '2011-04-28',
       '2011-05-01', '2011-05-03', '2011-05-04', '2011-05-05',
       '2011-05-06', '2011-05-08', '2011-05-09', '2011-05-10',
       '2011-05-11', '2011-05-12', '2011-05-13', '2011-05-15',
       '2011-05-16', '2011-05-17', '2011-05-18', '2011-05-19',
       '2011-05-20', '2011-05-22', '2011-05-23', '2011-05-24',
       '2011-05-25', '2011-05-26', '2011-05-27', '2011-05-29',
       '2011-05-31', '2011-06-01', '2011-06-02', '2011-06-03',
       '2011-06-05', '2011-06-06', '2011-06-07', '2011-06-08',
       '2011-06-09', '2011-06-10', '2011-06-12', '2011-06-13',
       '2011-06-14', '2011-06-15', '2011-06-16', '2011-06-17',
       '2011-06-19', '2011-06-20', '2011-06-21', '2011-06-22',
       '2011-06-23', '2011-06-24', '2011-06-26', '2011-06-27',
       '2011-06-28', '2011-06-29', '2011-06-30', '2011-07-01',
       '2011-07-03', '2011-07-04', '2011-07-05', '2011-07-06',
       '2011-07-07', '2011-07-08', '2011-07-10', '2011-07-11',
       '2011-07-12', '2011-07-13', '2011-07-14', '2011-07-15',
       '2011-07-17', '2011-07-18', '2011-07-19', '2011-07-20',
       '2011-07-21', '2011-07-22', '2011-07-24', '2011-07-25',
       '2011-07-26', '2011-07-27', '2011-07-28', '2011-07-29',
       '2011-07-31', '2011-08-01', '2011-08-02', '2011-08-03',
       '2011-08-04', '2011-08-05', '2011-08-07', '2011-08-08',
       '2011-08-09', '2011-08-10', '2011-08-11', '2011-08-12',
       '2011-08-14', '2011-08-15', '2011-08-16', '2011-08-17',
       '2011-08-18', '2011-08-19', '2011-08-21', '2011-08-22',
       '2011-08-23', '2011-08-24', '2011-08-25', '2011-08-26',
       '2011-08-28', '2011-08-30', '2011-08-31', '2011-09-01',
       '2011-09-02', '2011-09-04', '2011-09-05', '2011-09-06',
       '2011-09-07', '2011-09-08', '2011-09-09', '2011-09-11',
       '2011-09-12', '2011-09-13', '2011-09-14', '2011-09-15',
       '2011-09-16', '2011-09-18', '2011-09-19', '2011-09-20',
       '2011-09-21', '2011-09-22', '2011-09-23', '2011-09-25',
       '2011-09-26', '2011-09-27', '2011-09-28', '2011-09-29',
       '2011-09-30', '2011-10-02', '2011-10-03', '2011-10-04',
       '2011-10-05', '2011-10-06', '2011-10-07', '2011-10-09',
       '2011-10-10', '2011-10-11', '2011-10-12', '2011-10-13',
       '2011-10-14', '2011-10-16', '2011-10-17', '2011-10-18',
       '2011-10-19', '2011-10-20', '2011-10-21', '2011-10-23',
       '2011-10-24', '2011-10-25', '2011-10-26', '2011-10-27',
       '2011-10-28', '2011-10-30', '2011-10-31', '2011-11-01',
       '2011-11-02', '2011-11-03', '2011-11-04', '2011-11-06',
       '2011-11-07', '2011-11-08', '2011-11-09', '2011-11-10',
       '2011-11-11', '2011-11-13', '2011-11-14', '2011-11-15',
       '2011-11-16', '2011-11-17', '2011-11-18', '2011-11-20',
       '2011-11-21', '2011-11-22', '2011-11-23', '2011-11-24',
       '2011-11-25', '2011-11-27', '2011-11-28', '2011-11-29',
       '2011-11-30', '2011-12-01', '2011-12-02', '2011-12-04',
       '2011-12-05', '2011-12-06', '2011-12-07', '2011-12-08',
       '2011-12-09'], dtype=object)

In [25]:
# segmenting the transaction for the date '2010-12-01'
df_2010_12_01 = df_c.loc[df_c['date'] == '2010-12-01']
df_2010_12_01.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount,date
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,15.30,2010-12-01
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,22.00,2010-12-01
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,20.34,2010-12-01

In [26]:
df_2010_12_01.shape

(1896, 10)

In [27]:
# slicing the 2010-12-01 transactions for necessary features
df_2010_12_01_final = df_2010_12_01[['CustomerID','date','Quantity','UnitPrice','Amount']]
df_2010_12_01_final.head()

   CustomerID        date  Quantity  UnitPrice  Amount
0     17850.0  2010-12-01         6       2.55   15.30
1     17850.0  2010-12-01         6       3.39   20.34
2     17850.0  2010-12-01         8       2.75   22.00
3     17850.0  2010-12-01         6       3.39   20.34
4     17850.0  2010-12-01         6       3.39   20.34

In [41]:
# creating frequency column - number of item a customer purchased 
df_2010_12_01_f = pd.DataFrame(df_2010_12_01_final.groupby(['CustomerID'])['date'].count().reset_index())
df_2010_12_01_f.columns = ['CustomerID','frequency']
df_2010_12_01_f.tail()

    CustomerID  frequency
90     18011.0         28
91     18074.0         13
92     18085.0          9
93     18144.0          3
94     18229.0          7

In [42]:
# grouping the data based o customerID
df_2010_12_01_m = pd.DataFrame(df_2010_12_01_final.groupby(['CustomerID'])[['Amount','Quantity','UnitPrice']].sum().reset_index())
df_2010_12_01_m.head()

   CustomerID   Amount  Quantity  UnitPrice
0     12431.0   358.25       107      73.90
1     12433.0  1919.14      1852     102.67
2     12583.0   855.86       449      55.29
3     12662.0   261.48       157      44.37
4     12748.0     4.95         1       4.95

In [43]:
print(df_2010_12_01_m.shape, df_2010_12_01_f.shape)

(95, 4) (95, 2)

In [44]:
# merging frequency and monetary tables to final table
df_2010_12_01_fm = pd.merge(df_2010_12_01_m, df_2010_12_01_f, on='CustomerID',how='inner')
df_2010_12_01_fm.head()

   CustomerID   Amount  Quantity  UnitPrice  frequency
0     12431.0   358.25       107      73.90         14
1     12433.0  1919.14      1852     102.67         73
2     12583.0   855.86       449      55.29         20
3     12662.0   261.48       157      44.37         15
4     12748.0     4.95         1       4.95          1

In [46]:
df_2010_12_01_fm.shape

(95, 5)

In [47]:
df_2010_12_01_fm.isnull().sum()

CustomerID    0
Amount        0
Quantity      0
UnitPrice     0
frequency     0
dtype: int64

In [48]:
# segmenting the transaction for the date '2010-12-02'
df_2010_12_02 = df_c.loc[df_c['date'] == '2010-12-02']
df_2010_12_02.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,Amount,date
3108,536598,21421,PORCELAIN ROSE LARGE,12,2010-12-02 07:48:00,1.25,13090.0,United Kingdom,15.0,2010-12-02
3109,536598,21422,PORCELAIN ROSE SMALL,16,2010-12-02 07:48:00,0.85,13090.0,United Kingdom,13.6,2010-12-02
3110,536598,22178,VICTORIAN GLASS HANGING T-LIGHT,24,2010-12-02 07:48:00,1.25,13090.0,United Kingdom,30.0,2010-12-02
3111,536598,22617,BAKING SET SPACEBOY DESIGN,24,2010-12-02 07:48:00,4.25,13090.0,United Kingdom,102.0,2010-12-02
3112,536599,22968,ROSE COTTAGE KEEPSAKE BOX,8,2010-12-02 07:49:00,8.50,15694.0,United Kingdom,68.0,2010-12-02

In [49]:
# slicing the 2010-12-02 transactions for necessary features
df_2010_12_02_final = df_2010_12_02[['CustomerID','date','Quantity','UnitPrice','Amount']]
df_2010_12_02_final.head()

      CustomerID        date  Quantity  UnitPrice  Amount
3108     13090.0  2010-12-02        12       1.25    15.0
3109     13090.0  2010-12-02        16       0.85    13.6
3110     13090.0  2010-12-02        24       1.25    30.0
3111     13090.0  2010-12-02        24       4.25   102.0
3112     15694.0  2010-12-02         8       8.50    68.0

In [52]:
df_2010_12_02_final.shape

(1958, 5)

In [51]:
# creating frequency column - number of item a customer purchased 
df_2010_12_02_f = pd.DataFrame(df_2010_12_02_final.groupby(['CustomerID'])['date'].count().reset_index())
df_2010_12_02_f.columns = ['CustomerID','frequency']
df_2010_12_02_f.tail()

    CustomerID  frequency
93     17964.0         35
94     17976.0         57
95     18041.0         73
96     18168.0         27
97     18239.0         29

In [53]:
# grouping the data based o customerID
df_2010_12_02_m = pd.DataFrame(df_2010_12_02_final.groupby(['CustomerID'])[['Amount','Quantity','UnitPrice']].sum().reset_index())
df_2010_12_02_m.head()

   CustomerID  Amount  Quantity  UnitPrice
0     12738.0  155.35       148      43.45
1     12748.0    4.25         1       4.25
2     12855.0   38.10        30       4.65
3     12915.0  199.65        41     100.00
4     12971.0   45.12        84       2.92

In [54]:
# merging frequency and monetary tables to final table
df_2010_12_02_fm = pd.merge(df_2010_12_02_m, df_2010_12_02_f, on='CustomerID',how='inner')
df_2010_12_02_fm.head()

   CustomerID  Amount  Quantity  UnitPrice  frequency
0     12738.0  155.35       148      43.45         11
1     12748.0    4.25         1       4.25          1
2     12855.0   38.10        30       4.65          3
3     12915.0  199.65        41     100.00         13
4     12971.0   45.12        84       2.92          5

In [55]:
df_2010_12_02_fm.shape

(98, 5)

In [56]:
df_2010_12_02_fm.isnull().sum()

CustomerID    0
Amount        0
Quantity      0
UnitPrice     0
frequency     0
dtype: int64

# Save the below dfs

In [72]:
df_2010_12_01_fm.head()

   CustomerID   Amount  Quantity  frequency
0     12431.0   358.25       107         14
1     12433.0  1919.14      1852         73
2     12583.0   855.86       449         20
3     12662.0   261.48       157         15
4     12748.0     4.95         1          1

In [64]:
df_2010_12_01_fm = df_2010_12_01_fm.drop('UnitPrice', 1)

In [65]:
df_2010_12_01_fm.shape

(95, 4)

In [66]:
# saving 2010-12-01 customers data
df_2010_12_01_fm.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_01_fm.csv', index=False)

In [71]:
df_2010_12_02_fm.head()

   CustomerID  Amount  Quantity  frequency
0     12738.0  155.35       148         11
1     12748.0    4.25         1          1
2     12855.0   38.10        30          3
3     12915.0  199.65        41         13
4     12971.0   45.12        84          5

In [68]:
df_2010_12_02_fm = df_2010_12_02_fm.drop('UnitPrice', 1)

In [69]:
df_2010_12_02_fm.shape

(98, 4)

In [70]:
# saving 2010-12-02 customers data
df_2010_12_02_fm.to_csv(r'C:/Users/KodavaliPavanKumar/Desktop/Training/github_folders/Projects/MM_Sample/Data/df_2010_12_02_fm.csv', index=False)